# Brewfile - Curated Homebrew Packages
# Generated: 2025-10-16
# Total: 55 formulae (reduced from 296 - 81% cleanup!)
#   - Includes 3 RETRO-OS Phase 0 tools: zoxide, gum, sampler
#
# Usage:
#   brew bundle install --file=~/dotfiles/Brewfile

# ============================================================================
# Development Languages & Runtimes
# ============================================================================

brew "rust"                      # Systems programming language
brew "rust-analyzer"             # Rust LSP server
brew "oven-sh/bun/bun"          # Fast JavaScript runtime & package manager
brew "uv"                        # Fast Python package installer
brew "pyenv-virtualenv"          # Python version & environment management

# ============================================================================
# Text Editors
# ============================================================================

brew "neovim"                    # Hyperextensible Vim-based text editor
brew "msedit"                    # Retro Microsoft terminal editor

# ============================================================================
# CLI Utilities - Core
# ============================================================================

brew "bash"                      # Modern Bash shell (5.x) for scripts requiring Bash 4+
brew "bat"                       # Cat clone with syntax highlighting
brew "fd"                        # Fast alternative to find
brew "fzf"                       # Fuzzy finder
brew "ripgrep"                   # Fast grep alternative (rg)
brew "eza"                       # Modern replacement for ls
brew "jq"                        # JSON processor
brew "sd"                        # Sed alternative
brew "tree"                      # Directory tree visualization
brew "wget"                      # Network downloader
brew "yt-dlp"                    # Video downloader

# ============================================================================
# File Managers
# ============================================================================

brew "yazi"                      # Modern terminal file manager (primary)

# ============================================================================
# AI/LLM Tools
# ============================================================================

brew "qwen-code"                 # AI coding assistant
brew "opencode"                  # AI tooling evaluation
brew "charmbracelet/tap/crush"   # Charm log viewer
brew "specify"                   # GitHub AI coding tool

# ============================================================================
# Git Tools
# ============================================================================

brew "gh"                        # GitHub CLI
brew "lazygit"                   # Terminal UI for git
brew "tig"                       # Text-mode interface for git
brew "git-lfs"                   # Large File Storage for Git
brew "git-filter-repo"           # Quickly rewrite git repository history

# ============================================================================
# System Monitoring & Analysis
# ============================================================================

brew "htop"                      # Interactive process viewer
brew "mactop"                    # macOS activity monitor in terminal
brew "ncdu"                      # Disk usage analyzer with ncurses interface
brew "procs"                     # Modern replacement for ps

# ============================================================================
# Build Tools & Task Runners
# ============================================================================

brew "go-task"                   # Task runner / Make alternative
brew "just"                      # Command runner (Makefile alternative)

# ============================================================================
# Code Quality & Linting
# ============================================================================

brew "shellcheck"                # Shell script static analysis
brew "golangci-lint"             # Fast Go linters runner
brew "taplo"                     # TOML toolkit
brew "tree-sitter-cli"           # Parser generator & query tool
brew "ast-grep"                  # Structural code search & manipulation

# ============================================================================
# Terminal & Shell
# ============================================================================

brew "tmux"                      # Terminal multiplexer
brew "editorconfig"              # Maintain consistent coding styles
brew "gum"                       # Glamorous shell scripts (interactive prompts)
brew "sampler"                   # Terminal dashboard visualization
brew "zoxide"                    # Smarter cd command (autojump)

# ============================================================================
# Menu Bar
# ============================================================================

tap "FelixKratz/formulae"
brew "FelixKratz/formulae/sketchybar"  # Highly customizable macOS status bar
cask "font-hack-nerd-font"       # Required font for SketchyBar icons

# ============================================================================
# Productivity & Information
# ============================================================================

brew "glow"                      # Markdown renderer for CLI
brew "television"                # Fuzzy finder for everything
brew "jbreckmckye/formulae/daylight"  # Sun tracker for dashboard
brew "fastfetch"                 # System information tool
brew "fortune"                   # Random quotes for dashboard

# ============================================================================
# Package Management Tools
# ============================================================================

brew "mas"                       # Mac App Store CLI
brew "bitwarden-cli"             # Password manager CLI
brew "cosmincatalin/tap/brew-explorer"  # TUI for Homebrew

# ============================================================================
# Games & Entertainment
# ============================================================================

brew "angband"                   # Roguelike dungeon exploration game
