adamwalzer.scss-lint
albert.tabout
amos402.scope-bar
andreabbondanza.ignoregit
antfu.browse-lite
anthropic.claude-code
avraammavridis.vsc-react-documentation
bibhasdn.unique-lines
bierner.emojisense
bierner.markdown-checkbox
bourhaouta.tailwindshades
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
capaj.vscode-exports-autocomplete
cdonohue.quill-icons
christian-kohler.npm-intellisense
compulim.compulim-vscode-closetag
dae.vscode-mac-color-picker
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-faker
dooez.alt-catppuccin-vsc
eamodio.gitlens
editorconfig.editorconfig
enkia.tokyo-night
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.codespaces
github.copilot
github.copilot-chat
ibm.output-colorizer
ionutvmi.path-autocomplete
johnpapa.vscode-peacock
jrebocho.vscode-random
kamikillerto.vscode-colorize
kilocode.kilo-code
lmcarreiro.vscode-smart-column-indenter
marp-team.marp-vscode
mattn.lisp
mechatroner.rainbow-csv
meganrogge.template-string-converter
mishkinf.goto-next-previous-member
mrmlnc.vscode-duplicate
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
neilding.language-liquid
nicola-granata.zenburn-dark-matter
ofhumanbondage.react-proptypes-intellisense
openai.chatgpt
ow.vscode-subword-navigation
pflannery.vscode-versionlens
planbcoding.vscode-react-refactor
pranaygp.vscode-css-peek
qcz.text-power-tools
redhat.java
redhat.vscode-commons
redhat.vscode-xml
rescuecreative.onelineify
richie5um2.vscode-sort-json
romanpeshkov.vscode-text-tables
rust-lang.rust-analyzer
sissel.shopify-liquid
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
thepieterdc.thesaurus-vscode
theshukran.theshukran-react-utils
tlevesque2.duplicate-finder
tombonnike.vscode-status-bar-format-toggle
tomoki1207.selectline-statusbar
tomoki1207.vscode-input-sequence
tonybaloney.vscode-pets
travisthetechie.write-good-linter
tyriar.lorem-ipsum
ujjwalbarman.kamekazi-dark
urbantrout.refactor-css
usernamehw.errorlens
viablelab.capitalize
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
visualstudioexptteam.vscodeintellicode-completions
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vspacecode.whichkey
vue.volar
wattenberger.footsteps
wayou.vscode-todo-highlight
wmaurer.change-case
wraith13.zoombar-vscode
xabikos.javascriptsnippets
xabikos.reactsnippets
yzhang.markdown-all-in-one
zh9528.file-size
zignd.html-css-class-completion
